In [2]:
import pandas as pd

In [40]:
df_noteevents = pd.read_csv("../data/raw/mimic_iii/NOTEEVENTS.csv", usecols=["ROW_ID", "SUBJECT_ID", "HADM_ID", "CATEGORY", "ISERROR", "TEXT"])

In [77]:
df_noteevents = df_noteevents[(df_noteevents["ISERROR"].isna()) & (df_noteevents["CATEGORY"] == "Discharge summary")].copy()
df_noteevents = df_noteevents.drop_duplicates(subset=["SUBJECT_ID", "HADM_ID"], keep="first").copy()

In [78]:
print(df_noteevents.shape)
df_noteevents.head()

(52726, 6)

,ROW_ID,SUBJECT_ID,HADM_ID,CATEGORY,ISERROR,TEXT
0,174,22532,167853.0,Discharge summary,NaN,Admission Date: [**2151-7-16**] Dischar...
1,175,13702,107527.0,Discharge summary,NaN,Admission Date: [**2118-6-2**] Discharg...
2,176,13702,167118.0,Discharge summary,NaN,Admission Date: [**2119-5-4**] D...
3,177,13702,196489.0,Discharge summary,NaN,Admission Date: [**2124-7-21**] ...
4,178,26880,135453.0,Discharge summary,NaN,Admission Date: [**2162-3-3**] D...

In [79]:
df_noteevents.HADM_ID.unique()[:4]

array([167853., 107527., 167118., 196489.])

In [80]:
df_noteevents[df_noteevents["HADM_ID"] == 120654.0]

,ROW_ID,SUBJECT_ID,HADM_ID,CATEGORY,ISERROR,TEXT
15919,12032,20181,120654.0,Discharge summary,NaN,Admission Date: [**2173-10-13**] Discha...

In [83]:
df_noteevents.shape

(52726, 6)

In [84]:
df_diagnoses = pd.read_csv("../data/raw/mimic_iii/DIAGNOSES_ICD.csv")
df_diagnoses = df_diagnoses.sort_values("SEQ_NUM", ascending=True)
df_diagnoses = df_diagnoses.drop_duplicates(subset=["SUBJECT_ID", "HADM_ID"], keep="first")

In [85]:
print(df_diagnoses.shape)
df_diagnoses.head()

(58976, 5)

        ROW_ID  SUBJECT_ID  HADM_ID  SEQ_NUM ICD9_CODE
0         1297         109   172335      1.0     40301
111750  105624        9413   176956      1.0     86501
111742  105616        9412   148755      1.0     99674
519073  523522       71349   102891      1.0      0389
335323  328441       28882   166021      1.0     44100

In [86]:
# 1 is the most important seq_num

In [87]:
df = pd.merge(df_diagnoses, df_noteevents, on=["SUBJECT_ID", "HADM_ID"], how="left")
df = df[["TEXT", "Specialty"]].copy()

(58976, 9)

,ROW_ID_x,SUBJECT_ID,HADM_ID,SEQ_NUM,ICD9_CODE,ROW_ID_y,CATEGORY,ISERROR,TEXT
0,1297,109,172335,1.0,40301,14797.0,Discharge summary,NaN,Admission Date: [**2141-9-18**] ...
1,105624,9413,176956,1.0,86501,1802.0,Discharge summary,NaN,Admission Date: [**2187-9-19**] ...
2,105616,9412,148755,1.0,99674,14688.0,Discharge summary,NaN,Admission Date: [**2190-6-5**] Discharg...
3,523522,71349,102891,1.0,0389,6972.0,Discharge summary,NaN,Admission Date: [**2101-4-30**] ...
4,328441,28882,166021,1.0,44100,31799.0,Discharge summary,NaN,Admission Date: [**2146-9-15**] ...